;; -*- no-byte-compile: t; -*-
;;; ~/.dotfiles/editor/emacs/doom/packages.el

;; The ESC key is reachable in my custom keyboard layout so I don't need this
(package! evil-escape :disable t)
(package! nginx-mode)
(package! org-randomnote)
(package! org-super-agenda)
(package! org-cliplink)
(package! vimrc-mode)
(package! figlet)
(package! graphql-mode)
(package! eslintd-fix)
(package! prettier-js)
